lukasnee/m8ec/firmware/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
/**
  ******************************************************************************
  * @file    usbh_core.c
  * @author  MCD Application Team
  * @brief   This file implements the functions for the core state machine process
  *          the enumeration and the control transfer process
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "usbh_core.h"


/** @addtogroup USBH_LIB
  * @{
  */

/** @addtogroup USBH_LIB_CORE
  * @{
  */

/** @defgroup USBH_CORE
  * @brief This file handles the basic enumeration when a device is connected
  *          to the host.
  * @{
  */


/** @defgroup USBH_CORE_Private_Defines
  * @{
  */
#define USBH_ADDRESS_DEFAULT                     0x00U
#define USBH_ADDRESS_ASSIGNED                    0x01U
#define USBH_MPS_DEFAULT                         0x40U
/**
  * @}
  */

/** @defgroup USBH_CORE_Private_Macros
  * @{
  */
/**
  * @}
  */


/** @defgroup USBH_CORE_Private_Variables
  * @{
  */
#if (USBH_USE_OS == 1U)
#if (osCMSIS >= 0x20000U)
osThreadAttr_t USBH_Thread_Atrr;
#endif
#endif


/**
  * @}
  */


/** @defgroup USBH_CORE_Private_Functions
  * @{
  */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost);
static void USBH_HandleSof(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef DeInitStateMachine(USBH_HandleTypeDef *phost);

#if (USBH_USE_OS == 1U)
#if (osCMSIS < 0x20000U)
static void USBH_Process_OS(void const *argument);
#else
static void USBH_Process_OS(void *argument);
#endif
#endif

void USBH_ResetActiveClasses(USBH_HandleTypeDef *phost) {
  phost->pActiveClass = NULL;
  for (uint8_t i = 0U; i < USBH_MAX_NUM_ACTIVE_CLASSES; i++) {
    phost->ActiveInterfaces[i].pClass = NULL;
  }
  phost->ActiveInterfacesNumber = 0U;
  phost->ActiveInterfacesCurrIdx = 0U;
}

USBH_ClassTypeDef *USBH_ResolveSupportedClassForInterface(USBH_HandleTypeDef *phost, uint8_t itfDescIdx) {
  const uint8_t itfClassCode = phost->device.CfgDesc.Itf_Desc[itfDescIdx].bInterfaceClass;
  for (uint8_t i = 0U; i < phost->ClassNumber; i++) {
    if (phost->pClass[i]->ClassCode == itfClassCode) {
      return phost->pClass[i];
    }
  }
  USBH_ErrLog("Class %02Xh not supported", itfClassCode);
  return NULL;
}

uint8_t USBH_RegisterActiveClassInterfacePair(USBH_HandleTypeDef *phost, uint8_t itfDescrIdx, USBH_ClassTypeDef *pClass) {
  if (phost->ActiveInterfacesNumber < USBH_MAX_NUM_ACTIVE_CLASSES) {
    phost->ActiveInterfaces[phost->ActiveInterfacesNumber].descIdx = itfDescrIdx;
    phost->ActiveInterfaces[phost->ActiveInterfacesNumber].pClass = pClass;
    USBH_UsrLog("Registered class: %02Xh", pClass->ClassCode);
    USBH_DbgLog(
        "\n"
        "\tbInterfaceNumber: %d\n"
        "\tbAlternateSetting: %d\n"
        "\tbNumEndpoints: %d\n"
        "\tbInterfaceClass: %02Xh\n"
        "\tbInterfaceSubClass: %02Xh\n"
        "\tbInterfaceProtocol: %02Xh\n"
        "\tiInterface: %d\n",
        phost->device.CfgDesc.Itf_Desc[itfDescrIdx].bInterfaceNumber,
        phost->device.CfgDesc.Itf_Desc[itfDescrIdx].bAlternateSetting,
        phost->device.CfgDesc.Itf_Desc[itfDescrIdx].bNumEndpoints, phost->device.CfgDesc.Itf_Desc[itfDescrIdx].bInterfaceClass,
        phost->device.CfgDesc.Itf_Desc[itfDescrIdx].bInterfaceSubClass,
        phost->device.CfgDesc.Itf_Desc[itfDescrIdx].bInterfaceProtocol, phost->device.CfgDesc.Itf_Desc[itfDescrIdx].iInterface);
    phost->ActiveInterfacesNumber++;
    return 1;
  }
  USBH_ErrLog("Max Active Class Number reached");
  return 0;
}

uint8_t USBH_RegisterInterfaceClasses(USBH_HandleTypeDef *phost) {
  uint8_t numRegistered = 0U;
  USBH_DbgLog("Number of Interfaces: %d", phost->device.CfgDesc.bNumInterfaces);
  for (uint8_t itfDescrIdx = 0U; itfDescrIdx < phost->device.CfgDesc.bNumInterfaces; itfDescrIdx++) {
    USBH_ClassTypeDef *pClass = USBH_ResolveSupportedClassForInterface(phost, itfDescrIdx);
    if (!pClass) {
      continue;
    }
    if (!USBH_RegisterActiveClassInterfacePair(phost, itfDescrIdx, pClass)) {
      break;
    }
    numRegistered++;
  }
  return numRegistered;
}

/**
 * @brief  HCD_Init
 *         Initialize the HOST Core.
 * @param  phost: Host Handle
 * @param  pUsrFunc: User Callback
 * @retval USBH Status
 */
USBH_StatusTypeDef  USBH_Init(USBH_HandleTypeDef *phost,
                              void (*pUsrFunc)(USBH_HandleTypeDef *phost,
                              uint8_t id), uint8_t id)
{
  /* Check whether the USB Host handle is valid */
  if (phost == NULL)
  {
    USBH_ErrLog("Invalid Host handle");
    return USBH_FAIL;
  }

  /* Set DRiver ID */
  phost->id = id;

  /* Unlink class*/
  USBH_ResetActiveClasses(phost);
  phost->ClassNumber = 0U;

  /* Restore default states and prepare EP0 */
  DeInitStateMachine(phost);

  /* Restore default Device connection states */
  phost->device.PortEnabled = 0U;
  phost->device.is_connected = 0U;
  phost->device.is_disconnected = 0U;
  phost->device.is_ReEnumerated = 0U;

  /* Assign User process */
  if (pUsrFunc != NULL)
  {
    phost->pUser = pUsrFunc;
  }

#if (USBH_USE_OS == 1U)
#if (osCMSIS < 0x20000U)

  /* Create USB Host Queue */
  osMessageQDef(USBH_Queue, MSGQUEUE_OBJECTS, uint16_t);
  phost->os_event = osMessageCreate(osMessageQ(USBH_Queue), NULL);

  /* Create USB Host Task */
#if defined (USBH_PROCESS_STACK_SIZE)
  osThreadDef(USBH_Thread, USBH_Process_OS, USBH_PROCESS_PRIO, 0U, USBH_PROCESS_STACK_SIZE);
#else
  osThreadDef(USBH_Thread, USBH_Process_OS, USBH_PROCESS_PRIO, 0U, 8U * configMINIMAL_STACK_SIZE);
#endif /* defined (USBH_PROCESS_STACK_SIZE) */

  phost->thread = osThreadCreate(osThread(USBH_Thread), phost);

#else

  /* Create USB Host Queue */
  phost->os_event = osMessageQueueNew(MSGQUEUE_OBJECTS, sizeof(uint32_t), NULL);

